'''Используя принципы ООП, опишите класс Wine , который в дальнейшем может быть применим при создании электронного каталога вин. Продумайте, какие поля и методы понадобятся классу Wine, для выполнения следующих функций:
1. Хранение информации о виде вина: название, торговая марка, страна, дата разлива, многострочное примечание (может быть любое количество строк).
2. Доступ (установка и получение значений) к хранимой информации.
3. Расчёт выдержки вина (текущая дата даётся как аргумент).
Создайте от него несколько классов потомков.'''

'''Создайте структуру с именем Student, содержащую поля: фамилия и инициалы, номер группы, успеваемость (массив из пяти элементов). 
Создать массив из десяти элементов такого типа, упорядочить записи по возрастанию среднего балла. 
Добавить возможность вывода фамилий и номеров групп студентов, имеющих оценки, равные только 4 или 5.'''

'''Реализуйте класс Student (Студент), который будет наследовать от класса User. 
Этот класс должен иметь следующие свойства: name (имя, наследуется от User), surname (фамилия, наследуется от User), year (год поступления в вуз). Класс должен иметь метод getFullName() (наследуется от User), с помощью которого можно вывести одновременно имя и фамилию студента. Также класс должен иметь метод getCourse(), который будет выводить текущий курс студента (от 1 до 5). Курс вычисляется так: нужно от текущего года отнять год поступления в вуз. Текущий год получите самостоятельно.
'''

'''Составить описание класса для представления времени. 
Предусмотреть возможности установки времени и изменения его отдельных полей (час, минута, секунда) с проверкой допустимости вводимых значений. 
В случае недопустимых значений полей выбрасываются исключения. 
Создать методы изменения времени на заданное количество часов, минут и секунд.'''

'''Задача на взаимодействие между классами. 
Разработать систему «Железнодорожная касса». 
Пассажир делает заявку на станцию назначения, время и дату поездки. 
Система регистрирует Заявку и осуществляет поиск соответствующего Поезда. 
Пассажир делает выбор Поезда и получает Счет на оплату. 
Кассир вводит номера Поездов, промежуточные и конечные станции, цены.'''